{
    "$id": "http:\/\/schema.org.apievangelist.com\/schema\/objects\/GeoCircle.json",
    "schema": "http:\/\/json-schema.org\/draft-07\/schema#",
    "description": "A GeoCircle is a GeoShape representing a circular geographic area. As it is a GeoShape           it provides the simple textual property  circle , but also allows the combination of postalCode alongside geoRadius.           The center of the circle can be indicated via the  geoMidpoint  property, or more approximately using  address ,  postalCode .",
    "properties": {
        "geoRadius": {
            "description": "Indicates the approximate radius of a GeoCircle (metres unless indicated otherwise via Distance notation).",
            "schema": {
                "$ref": "http://schema.org.apievangelist.com/schema/objects/Distance"
            }
        },
        "geoMidpoint": {
            "description": "Indicates the GeoCoordinates at the centre of a GeoShape e.g. GeoCircle.",
            "schema": {
                "$ref": "http://schema.org.apievangelist.com/schema/objects/GeoCoordinates"
            }
        },
        "line": {
            "description": "A line is a point-to-point path consisting of two or more points. A line is expressed as a series of two or more point objects separated by space.",
            "type": "string"
        },
        "address": {
            "description": "Physical address of the item.",
            "schema": {
                "$ref": "http://schema.org.apievangelist.com/schema/objects/PostalAddress"
            }
        },
        "circle": {
            "description": "A circle is the circular region of a specified radius centered at a specified latitude and longitude. A circle is expressed as a pair followed by a radius in meters.",
            "type": "string"
        },
        "box": {
            "description": "A box is the area enclosed by the rectangle formed by two points. The first point is the lower corner, the second point is the upper corner. A box is expressed as two points separated by a space character.",
            "type": "string"
        },
        "addressCountry": {
            "description": "The country. For example, USA. You can also provide the two-letter ISO 3166-1 alpha-2 country code.",
            "schema": {
                "$ref": "http://schema.org.apievangelist.com/schema/objects/Country"
            }
        },
        "postalCode": {
            "description": "The postal code. For example, 94043.",
            "type": "string"
        },
        "elevation": {
            "description": "The elevation of a location (WGS 84).",
            "type": "string"
        },
        "polygon": {
            "description": "A polygon is the area enclosed by a point-to-point path for which the starting and ending points are the same. A polygon is expressed as a series of four or more space delimited points where the first and final points are identical.",
            "type": "string"
        },
        "sameAs": {
            "description": "URL of a reference Web page that unambiguously indicates the item s identity. E.g. the URL of the item s Wikipedia page, Wikidata entry, or official website.",
            "schema": {
                "$ref": "http://schema.org.apievangelist.com/schema/objects/URL"
            }
        },
        "url": {
            "description": "URL of the item.",
            "schema": {
                "$ref": "http://schema.org.apievangelist.com/schema/objects/URL"
            }
        },
        "image": {
            "description": "An image of the item. This can be a URL or a fully described ImageObject.",
            "schema": {
                "$ref": "http://schema.org.apievangelist.com/schema/objects/ImageObject"
            }
        },
        "additionalType": {
            "description": "An additional type for the item, typically used for adding more specific types from external vocabularies in microdata syntax. This is a relationship between something and a class that the thing is in. In RDFa syntax, it is better to use the native RDFa syntax - the  typeof  attribute - for multiple types. Schema.org tools may have only weaker understanding of extra types, in particular those defined externally.",
            "schema": {
                "$ref": "http://schema.org.apievangelist.com/schema/objects/URL"
            }
        },
        "name": {
            "description": "The name of the item.",
            "type": "string"
        },
        "identifier": {
            "description": "The identifier property represents any kind of identifier for any kind of Thing, such as ISBNs, GTIN codes, UUIDs etc. Schema.org provides dedicated properties for representing many of these, either as textual strings or as URL (URI) links. See background notes for more details.",
            "schema": {
                "$ref": "http://schema.org.apievangelist.com/schema/objects/PropertyValue"
            }
        },
        "potentialAction": {
            "description": "Indicates a potential Action, which describes an idealized action in which this thing would play an  object  role.",
            "schema": {
                "$ref": "http://schema.org.apievangelist.com/schema/objects/Action"
            }
        },
        "mainEntityOfPage": {
            "description": "Indicates a page (or other CreativeWork) for which this thing is the main entity being described. See background notes for details.",
            "schema": {
                "$ref": "http://schema.org.apievangelist.com/schema/objects/URL"
            }
        },
        "description": {
            "description": "A description of the item.",
            "type": "string"
        },
        "disambiguatingDescription": {
            "description": "A sub property of description. A short description of the item used to disambiguate from other, similar items. Information from other properties (in particular, name) may be necessary for the description to be useful for disambiguation.",
            "type": "string"
        },
        "alternateName": {
            "description": "An alias for the item.",
            "type": "string"
        }
    }
}